performance/reopen_task.yml
config:
  target: "https://api.todoist.com"
  phases: 
    - duration: 5
      arrivalRate: 1
      name: "Warm up"
  defaults:
    headers:
      Authorization: Bearer fe5b514cb2309013eac2f7177044fdc6216964a1
      Content-Type: application/json
  variables:
    project_name:
      - "Reopen Task"
    url_task: 
      - "/rest/v1/tasks"
    task_name:
      - "Create task performance"
    close_task:
      - "close"
    reopen_task:
      - "reopen"
scenarios:
  - flow:
    - post:
        url: "{{ url_task }}"
        json: 
          content: "{{ task_name }}"
        capture: 
          json: "$.id"
          as: "id_task"
    - log: "Task id is {{ id_task }}"
    - think: 5
    - post:
        url: "{{ url_task }}/{{ id_task }}/{{ close_task }}"
    - log: "Task id is {{ id_task }} was closed"
    - think: 5
    - post:
        url: "{{ url_task }}/{{ id_task }}/{{ reopen_task }}"
    - log: "Task id is {{ id_task }} was reopen"